Examinator/src/InformationRegisters/ЗначенияНастроекИнтерактивныхРесурсовСУЗ/ЗначенияНастроекИнтерактивныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияНастроекИнтерактивныхРесурсовСУЗ</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Представление</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>CatalogRef.НастройкиИнтерактивногоРесурсаСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ЗначенияНастроекИнтерактивныхРесурсовСУЗ/Forms/ФормаЗаписи/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура РазместитьЗначениеНастройки(Настройка)
	
	ОписаниеТипа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Настройка, "ОписаниеТипа").Получить();
	
	РазработкаСУЗ.РазметитьПолеРедактированияНастройкиИнтерактивногоРесурса(ЭтотОбъект, ОписаниеТипа);
	
КонецПроцедуры


&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//////////////////////////////////////////////////////////////////
	
	РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(Запись);
	РазработкаСУЗ.УстановитьДоступностьДанныхОтПоставщика(ЭтотОбъект,,,"Запись");
	
	//////////////////////////////////////////////////////////////////
	


	Если Запись.ИсходныйКлючЗаписи.Пустой() Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ЗначенияНастроекИнтерактивныхРесурсовСУЗ.Номер КАК Номер
			|ИЗ
			|	РегистрСведений.ЗначенияНастроекИнтерактивныхРесурсовСУЗ КАК ЗначенияНастроекИнтерактивныхРесурсовСУЗ
			|ГДЕ
			|	ЗначенияНастроекИнтерактивныхРесурсовСУЗ.СсылкаНаОбъектСУЗ = &СсылкаНаОбъектСУЗ
			|	И ЗначенияНастроекИнтерактивныхРесурсовСУЗ.Настройка = &Настройка
			|
			|УПОРЯДОЧИТЬ ПО
			|	Номер УБЫВ";

		Запрос.УстановитьПараметр("Настройка", Запись.Настройка);
		Запрос.УстановитьПараметр("СсылкаНаОбъектСУЗ", Запись.СсылкаНаОбъектСУЗ);

		Результат = Запрос.Выполнить();

		Если Результат.Пустой() Тогда
			
			Запись.Номер = 1;
			
		Иначе
			
			ВыборкаДетальныеЗаписи = Результат.Выбрать();
			
			ВыборкаДетальныеЗаписи.Следующий();
			
			Запись.Номер = ВыборкаДетальныеЗаписи.Номер + 1;
			
		КонецЕсли;

		РазместитьЗначениеНастройки(Запись.Настройка);
		
	КонецЕсли;
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	РазместитьЗначениеНастройки(ТекущийОбъект.Настройка);
	
	ЭтотОбъект["ЗначениеНастройки"] = ТекущийОбъект.Значение.Получить();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Значение      = Новый ХранилищеЗначения(ЭтотОбъект["ЗначениеНастройки"]);
	ТекущийОбъект.Представление = ЭтотОбъект["ЗначениеНастройки"];
	
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура НастройкаПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ <Наименование>
